tutorials/immersedBoundary/porousBumpChannelIb/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    porousBumpChannel
    {
        type            immersedBoundaryWallFunction;
        patchType       immersedBoundary;
        refValue        uniform 1e-10;
        refGradient     uniform 0;
        fixesValue      false;
        setDeadCellValue yes;
        deadCellValue   1e-10;
        value           nonuniform 0();
    }
    topAndBottom
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
